## Pandas aggregation and Pivot Tables

In [104]:
# import 

import pandas as pd 
import  numpy as np

### Data loading

In [105]:
# Data loading
df_titanic =  pd.read_csv("./data/titanic.csv")
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

### Data Cleaning

In [106]:
# remove duplicates
df_titanic = df_titanic.drop_duplicates()

In [107]:
# remove null values 
df_titanic = df_titanic.dropna()

### Group_by (Recap)

In [108]:
# Groupby "sex" and find the average For Each Sex

In [109]:
# Groupby "sex" "Pclass" and get the agg

### Pivot Tables

The pivot() function in pandas is used to create a pivot table from a DataFrame. It allows you to summarize and aggregate data in a very flexible way.

```python

DataFrame.pivot(
    index=None,
    columns=None, 
    values=None)

```


Parameters:

    index: column or array-like — Column(s) to use as the new index.
    columns: column or array-like — Column(s) to use as the new columns.
    values: column or array-like — The column(s) to use for the values in the new DataFrame.

### Pivot Table

pivot table to count the number of passegers per class

In [110]:
# pivot table  on Pclass

#### Pivoting Titanic Data to Show Average Age for Each Survival Group

In [111]:
# a pivot table on "Survived"

### Pivot table with aggregate functions

Common Aggregation Functions in Pandas:

    Sum (sum): Adds up all the values in a column or group.
    Mean (mean): Computes the average of the values in a column or group.
    Count (count): Counts the number of non-NA/null entries in a column or group.
    Minimum (min): Finds the smallest value in a column or group.
    Maximum (max): Finds the largest value in a column or group.
    Standard Deviation (std): Computes the standard deviation of the values in a column or group.
    Variance (var): Computes the variance of the values in a column or group.
    Median (median): Finds the middle value in a column or group.
    First (first): Returns the first value in a column or group.
    Last (last): Returns the last value in a column or group.

In [112]:
# pivot with aggregate functions

### Multiple Columns

In [113]:
# pivoting on multiple columns